### 🔧 Bootstrap Terraform Plan

```hcl
null_resource.k3s_server: Refreshing state... [id=3548877021921212656]
local_sensitive_file.ssh_key: Refreshing state... [id=f6bef8bf75abefb62ee12a1e5d4dc5fffd3bede3]
cloudflare_record.infra_records["auth"]: Refreshing state... [id=76f911197685888fb53b7491a4ad5b1c]
cloudflare_record.x_staging: Refreshing state... [id=994d200bafbce9b2e8c0c3d1b4536678]
cloudflare_record.root: Refreshing state... [id=6af3d1fa49c3d911892f195a4c7fd6c4]
cloudflare_record.infra_records["k3s"]: Refreshing state... [id=34540150c83277063b0e8752aabbe4d3]
cloudflare_record.infra_records["home"]: Refreshing state... [id=b3a26757041f1edd4d855554356d2084]
cloudflare_record.wildcard_public: Refreshing state... [id=ad4c7065dfdc814f8fceb49ebe907ae4]
cloudflare_record.infra_records["kdashboard"]: Refreshing state... [id=8ed6a6305893dd0bdead535fd5d45016]
cloudflare_record.infra_records["kcloud"]: Refreshing state... [id=6f06ad93f69bd78245fdfe8a57ddd189]
cloudflare_record.infra_records["openpanel"]: Refreshing state... [id=96fe6a95fd7414d551adc36bdd9c3176]
cloudflare_record.infra_records["secrets"]: Refreshing state... [id=fd7459cadcd7cc6b278b3cf48a0b1398]
cloudflare_record.infra_records["signoz"]: Refreshing state... [id=5b90434833452b7d428d61c7d33c1263]
cloudflare_record.infra_records["sso"]: Refreshing state... [id=70ad91913df52a16ec8902afdb9bb6e1]
cloudflare_record.infra_records["digger"]: Refreshing state... [id=9fc7192d978f4a4a56c099b4498369e4]
cloudflare_record.infra_records["kapi"]: Refreshing state... [id=281f5c2bf647990805ca894fc0631038]
cloudflare_record.wildcard_internal[0]: Refreshing state... [id=d2abf7cd2683a09c2158d35e009219f7]
null_resource.kubeconfig: Refreshing state... [id=5051680289967530463]
data.local_file.kubeconfig: Reading...
data.local_file.kubeconfig: Read complete after 0s [id=e8e9d6301d5e9261409aef623945966463087ba8]
kubectl_manifest.traefik_config: Refreshing state... [id=/apis/helm.cattle.io/v1/namespaces/kube-system/helmchartconfigs/traefik]
time_sleep.wait_for_digger_dns: Refreshing state... [id=2025-12-24T16:43:55Z]
data.dns_a_record_set.digger: Reading...
data.dns_a_record_set.digger: Read complete after 0s [id=digger.zitian.party]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.digger_health will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "digger_health" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://digger.zitian.party/health"

      + retry {
          + attempts     = 5
          + max_delay_ms = 5000
          + min_delay_ms = 1000
        }
    }

  # helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.13.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.cnpg_operator will be created
  + resource "helm_release" "cnpg_operator" {
      + atomic                     = false
      + chart                      = "cloudnative-pg"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cnpg"
      + namespace                  = "cnpg-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://cloudnative-pg.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "monitoring":
                  "podMonitorEnabled": false
            EOT,
        ]
      + verify                     = false
      + version                    = "0.22.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.digger will be created
  + resource "helm_release" "digger" {
      + atomic                     = false
      + chart                      = "digger-backend"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "digger"
      + namespace                  = "bootstrap"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://diggerhq.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.cluster_issuer_letsencrypt_prod will be created
  + resource "kubectl_manifest" "cluster_issuer_letsencrypt_prod" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-prod"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-prod
            spec:
              acme:
                email: admin@truealpha.club
                privateKeySecretRef:
                  name: letsencrypt-prod
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    cloudflare:
                      apiTokenSecretRef:
                        key: api-token
                        name: cloudflare-api-token-secret
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.local_path_provisioner_restart will be created
  + resource "kubectl_manifest" "local_path_provisioner_restart" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "local-path-provisioner"
      + namespace               = "kube-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: local-path-provisioner
              namespace: kube-system
            spec:
              template:
                metadata:
                  annotations:
                    infra.zitian.party/config-hash: d5a369c1a8a8e7ddc9e80904f26256a2b40438bc
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.platform_pg will be created
  + resource "kubectl_manifest" "platform_pg" {
      + api_version             = "postgresql.cnpg.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Cluster"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "platform-pg"
      + namespace               = "platform"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: postgresql.cnpg.io/v1
            kind: Cluster
            metadata:
              labels:
                layer: Platform
              name: platform-pg
              namespace: platform
            spec:
              bootstrap:
                initdb:
                  database: vault
                  owner: postgres
                  postInitSQL:
                  - CREATE DATABASE casdoor;
                  - CREATE DATABASE digger;
                  - CREATE TABLE IF NOT EXISTS vault_kv_store (parent_path TEXT COLLATE "C" NOT
                    NULL, path TEXT COLLATE "C", key TEXT COLLATE "C", value BYTEA, CONSTRAINT
                    pkey PRIMARY KEY (path, key));
                  - CREATE INDEX IF NOT EXISTS parent_path_idx ON vault_kv_store (parent_path);
                  - CREATE TABLE IF NOT EXISTS vault_ha_locks (ha_key TEXT COLLATE "C" NOT NULL,
                    ha_identity TEXT COLLATE "C" NOT NULL, ha_value TEXT COLLATE "C", valid_until
                    TIMESTAMP WITH TIME ZONE NOT NULL, CONSTRAINT ha_key PRIMARY KEY (ha_key));
              instances: 1
              monitoring:
                enablePodMonitor: false
              postgresql:
                parameters:
                  effective_cache_size: 256MB
                  max_connections: "100"
                  shared_buffers: 128MB
                  wal_level: replica
              resources:
                limits:
                  cpu: 500m
                  memory: 512Mi
                requests:
                  cpu: 100m
                  memory: 128Mi
              storage:
                size: 10Gi
                storageClass: local-path-retain
              superuserSecret:
                name: platform-pg-superuser
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.wildcard_certificate_internal will be created
  + resource "kubectl_manifest" "wildcard_certificate_internal" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Certificate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "wildcard-tls-internal"
      + namespace               = "cert-manager"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: Certificate
            metadata:
              name: wildcard-tls-internal
              namespace: cert-manager
            spec:
              dnsNames:
              - zitian.party
              - '*.zitian.party'
              issuerRef:
                kind: ClusterIssuer
                name: letsencrypt-prod
              secretName: wildcard-tls-internal
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.wildcard_certificate_public will be created
  + resource "kubectl_manifest" "wildcard_certificate_public" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Certificate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "wildcard-tls-public"
      + namespace               = "cert-manager"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: Certificate
            metadata:
              name: wildcard-tls-public
              namespace: cert-manager
            spec:
              dnsNames:
              - truealpha.club
              - '*.truealpha.club'
              issuerRef:
                kind: ClusterIssuer
                name: letsencrypt-prod
              secretName: wildcard-tls-public
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_config_map_v1.local_path_config will be created
  + resource "kubernetes_config_map_v1" "local_path_config" {
      + data = {
          + "config.json"    = jsonencode(
                {
                  + nodePathMap = [
                      + {
                          + node  = "DEFAULT_PATH_FOR_NON_LISTED_NODES"
                          + paths = [
                              + "/data/local-path-provisioner",
                            ]
                        },
                    ]
                }
            )
          + "helperPod.yaml" = <<-EOT
                apiVersion: v1
                kind: Pod
                metadata:
                  name: helper-pod
                spec:
                  containers:
                  - name: helper-pod
                    image: "rancher/mirrored-library-busybox:1.36.1"
                    imagePullPolicy: IfNotPresent
            EOT
          + "setup"          = <<-EOT
                #!/bin/sh
                set -eu
                mkdir -m 0777 -p "${VOL_DIR}"
                chmod 700 "${VOL_DIR}/.."
            EOT
          + "teardown"       = <<-EOT
                #!/bin/sh
                set -eu
                rm -rf "${VOL_DIR}"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "local-path-config"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.bootstrap will be created
  + resource "kubernetes_namespace" "bootstrap" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "layer" = "L1"
            }
          + name             = "bootstrap"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.cert_manager will be created
  + resource "kubernetes_namespace" "cert_manager" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.platform will be created
  + resource "kubernetes_namespace" "platform" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "layer" = "Platform"
            }
          + name             = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.cloudflare_api_token will be created
  + resource "kubernetes_secret" "cloudflare_api_token" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token-secret"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.platform_pg_superuser will be created
  + resource "kubernetes_secret" "platform_pg_superuser" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "platform-pg-superuser"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_storage_class.local_path_retain will be created
  + resource "kubernetes_storage_class" "local_path_retain" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + reclaim_policy         = "Retain"
      + storage_provisioner    = "rancher.io/local-path"
      + volume_binding_mode    = "WaitForFirstConsumer"

      + metadata {
          + generation       = (known after apply)
          + name             = "local-path-retain"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # local_sensitive_file.ssh_key will be created
  + resource "local_sensitive_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "/tmp/infra-k3s.id_rsa"
      + id                   = (known after apply)
    }

  # time_sleep.wait_for_digger_https will be created
  + resource "time_sleep" "wait_for_digger_https" {
      + create_duration = "120s"
      + id              = (known after apply)
      + triggers        = {
          + "digger_version" = "0.1.0"
          + "domain"         = "digger.zitian.party"
        }
    }

  # time_sleep.wait_for_platform_pg will be created
  + resource "time_sleep" "wait_for_platform_pg" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

> To apply: comment `/bootstrap apply`